etc/OpenFOAM_Sample_Files/building_test/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*  Windows port by CFD support (www.cfdsupport.com) [based on Symscape]     *\
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

14
(
    floor
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       14300;
    }
    ceiling
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       14400;
    }
    south_wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       14500;
    }
    north_wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       14600;
    }
    east_wall0
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       14700;
    }
    east_wall1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       14800;
    }
    east_wall2
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       14900;
    }
    east_wall3
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       15000;
    }
    west_wall0
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       15100;
    }
    west_wall1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       15200;
    }
    west_wall2
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       15300;
    }
    west_wall3
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       15400;
    }
    east_window
    {
        type            patch;
        nFaces          100;
        startFace       15500;
    }
    west_window
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       15600;
    }
)

// ************************************************************************* //
